Core/src/Documents/ПереоценкаВРозницеСуммовойУчет/ПереоценкаВРозницеСуммовойУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПереоценкаВРозницеСуммовойУчет</name>
  <registerRecords>AccumulationRegister.СуммовойУчетВРознице</registerRecords>
  <registerRecords>AccountingRegister.Управленческий</registerRecords>
  <registerRecords>AccumulationRegister.ДоходыИРасходы</registerRecords>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Корреспонденция</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>КорреспонденцияРегл</name>
    <type>
      <types>ChartOfAccountsRef.Управленческий</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НоваяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Core/src/AccumulationRegisters/СуммовойУчетВРознице/СуммовойУчетВРознице.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>СуммовойУчетВРознице</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаВал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СодержаниеПроводки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПродажи</name>
    <type>
      <types>DocumentRef.ПоступлениеВКассу</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтруктурнаяЕдиница</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/InformationRegisters/УчетнаяПолитикаРегл/УчетнаяПолитикаРегл.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УчетнаяПолитикаРегл</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>СчетНезавершенноеПроизводство</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаДеньги</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаЗадолженность</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>РозничныйКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>ДоговорРозничногоКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДДСРозничныхПродаж</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихДоходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрочихРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПрибыльУбытки</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетДеньгиВПути</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетПоложительнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетОтрицательнаяКурсоваяРазницаКонвертация</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажи</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыль</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаНалогаНаПрибыльПодлежащийОплате</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаИмпортВозвратРегл</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетТранзитногоСклада</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>ВидНадогаДляСчетовНДС</name>
    <type>
      <types>CatalogRef.ВидыНалогов</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДСБезвозмезднойПродажиСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратНДФЛСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратПФСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетЗатратВозврат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажа</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СчетУчетаСвободнаяпродажаСотрудник</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>AzRyРозничныйКонтрагентАналитика</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Core/src/Enums/ТипыСчетов/ТипыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыСчетов</name>
  <enumValues>
    <name>АмортизацияВнеоборотныхАктивов</name>
    <comment>02</comment>
  </enumValues>
  <enumValues>
    <name>ВнеоборотныеАктивы</name>
    <comment>01</comment>
  </enumValues>
  <enumValues>
    <name>ГруппаСчетов</name>
    <comment>Служебный</comment>
  </enumValues>
  <enumValues>
    <name>Дебиторы</name>
    <comment>62.01, 60.02, 68.02, 71.02</comment>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредства</name>
    <comment>50, 51, 57</comment>
  </enumValues>
  <enumValues>
    <name>ДолгосрочныеОбязательства</name>
    <comment>67</comment>
  </enumValues>
  <enumValues>
    <name>Доходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>Запасы</name>
    <comment>10, 41</comment>
  </enumValues>
  <enumValues>
    <name>Капитал</name>
    <comment>80</comment>
  </enumValues>
  <enumValues>
    <name>КосвенныеЗатраты</name>
    <comment>25</comment>
  </enumValues>
  <enumValues>
    <name>КраткосрочныеФинансовыеВложения</name>
    <comment>58</comment>
  </enumValues>
  <enumValues>
    <name>Кредиторы</name>
    <comment>60.01, 62.02, 68.01, 70.01, 71.01</comment>
  </enumValues>
  <enumValues>
    <name>КредитыИЗаймы</name>
    <comment>66</comment>
  </enumValues>
  <enumValues>
    <name>НалогНаПрибыль</name>
  </enumValues>
  <enumValues>
    <name>НезавершенноеПроизводство</name>
    <comment>20</comment>
  </enumValues>
  <enumValues>
    <name>НераспределеннаяПрибыль</name>
    <comment>84</comment>
  </enumValues>
  <enumValues>
    <name>ПрибылиУбытки</name>
    <comment>99</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентыПоКредитам</name>
  </enumValues>
  <enumValues>
    <name>ПрочиеВнеоборотныеАктивы</name>
    <comment>08</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеДоходы</name>
    <comment>90.01</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеКраткосрочныеОбязательства</name>
    <comment>98</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеОборотныеАктивы</name>
    <comment>94, 97</comment>
  </enumValues>
  <enumValues>
    <name>ПрочиеРасходы</name>
    <comment>91.02</comment>
  </enumValues>
  <enumValues>
    <name>Расходы</name>
    <comment>90.07, 90.08</comment>
  </enumValues>
  <enumValues>
    <name>РезервныйИДобавочныйКапитал</name>
    <comment>82</comment>
  </enumValues>
  <enumValues>
    <name>СебестоимостьПродаж</name>
    <comment>90.02</comment>
  </enumValues>
  <enumValues>
    <name>ТорговаяНаценка</name>
  </enumValues>
</mdclass:Enum>

Core/src/Documents/ПереоценкаВРозницеСуммовойУчет/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПереоценкаВРозницеСуммовойУчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ПереоценкаВРозницеСуммовойУчет", НСтр("ka='გადაფასება საცალო ვაჭრობაში';ru='Переоценка в рознице'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.ВалютаДокумента КАК Валюта,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице КАК СчетУчета,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице КАК СтруктурнаяЕдиницаСчетУчетаВРознице,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки КАК СтруктурнаяЕдиницаСчетУчетаНаценки,
	//+++ Дмгг
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРозницеРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРозницеРегл КАК СтруктурнаяЕдиницаСчетУчетаВРозницеРегл,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл КАК СтруктурнаяЕдиницаСчетУчетаНаценкиРегл,
	//--- Дмгг
	|	ТаблицаДокумента.ЗаказПокупателя КАК ЗаказПокупателя,
	|	СУММА(ТаблицаДокумента.Сумма) КАК Сумма,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВал,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаДляОстатка,
	|	СУММА(ТаблицаДокумента.СуммаВал) КАК СуммаВалДляОстатка,
	|	0 КАК Себестоимость,
	|	&ПереоценкаВРозницеСуммовойУчет КАК СодержаниеПроводки
	|ПОМЕСТИТЬ ВременнаяТаблицаСуммовойУчетВРознице
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.ВалютаДокумента,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки,
	//+++ Дмгг
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРозницеРегл,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРозницеРегл,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл,
	//--- Дмгг
	|	ТаблицаДокумента.ЗаказПокупателя
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	СтруктурнаяЕдиница,
	|	Валюта,
	|	СчетУчета,
	|	СчетУчетаРегл"; //+++ Дмгг
	
	Запрос.Выполнить();
	
	// Установка исключительной блокировки контролируемых остатков денежных средств.
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВременнаяТаблицаСуммовойУчетВРознице.Организация КАК Организация,
	|	ВременнаяТаблицаСуммовойУчетВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВременнаяТаблицаСуммовойУчетВРознице.Валюта КАК Валюта
	|ИЗ
	|	ВременнаяТаблицаСуммовойУчетВРознице КАК ВременнаяТаблицаСуммовойУчетВРознице";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.СуммовойУчетВРознице");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.ИсточникДанных = РезультатЗапроса;
	
	Для каждого КолонкаРезультатЗапроса Из РезультатЗапроса.Колонки Цикл
		ЭлементБлокировки.ИспользоватьИзИсточникаДанных(КолонкаРезультатЗапроса.Имя, КолонкаРезультатЗапроса.Имя);
	КонецЦикла;
	Блокировка.Заблокировать();
	
	НомерЗапроса = 0;
	Запрос.Текст = УправлениеНебольшойФирмойСервер.ПолучитьТекстЗапросаКурсовыеРазницыСуммовойУчетВРознице(Запрос.МенеджерВременныхТаблиц, НомерЗапроса);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСуммовойУчетВРознице", МассивРезультатов[НомерЗапроса].Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства)
	
	//+++ Дмгг
	тзСчетовУчетнойПолитики = РегистрыСведений.УчетнаяПолитикаРегл.СрезПоследних(ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Дата, Новый Структура("Организация", ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Организация));
	
	ПрочиеДоходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	ПрочиеРасходыРегл = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
	
	Если тзСчетовУчетнойПолитики.Количество() <> 0 Тогда 
		ПрочиеДоходыРегл = тзСчетовУчетнойПолитики[0].СчетПрочихДоходов;
		ПрочиеРасходыРегл = тзСчетовУчетнойПолитики[0].СчетПрочихРасходов;
	КонецЕсли;
	//--- Дмгг
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов'"));
	Запрос.УстановитьПараметр("ОтражениеРасходов", НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Дата),ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Дата,ТекущаяДата())));
	//+++ Дмгг
	Запрос.УстановитьПараметр("ПрочиеДоходыРегл", ПрочиеДоходыРегл);
	Запрос.УстановитьПараметр("ПрочиеРасходыРегл", ПрочиеРасходыРегл);
	//--- Дмгг
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка) КАК СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее) КАК НаправлениеДеятельности,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ КАК СчетУчета,
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА &ПрочиеДоходыРегл
	|		ИНАЧЕ &ПрочиеРасходыРегл
	|	КОНЕЦ КАК СчетУчетаРегл,
	//--- Дмгг
	|	ТаблицаДокумента.Валюта КАК Аналитика,
	|	&КурсоваяРазница КАК СодержаниеПроводки,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаДоходов,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА 0
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ КАК СуммаРасходов
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице КАК ТаблицаДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл, //--- Дмгг
	|	НЕОПРЕДЕЛЕНО,
	|	&ОтражениеРасходов,
	|	0,
	|	-ТаблицаДокумента.Сумма
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|		ИНАЧЕ ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|	КОНЕЦ
	//--- Дмгг
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка),
	|	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.Прочее),
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл, //+++ Дмгг
	|	НЕОПРЕДЕЛЕНО,
	|	&ОтражениеДоходов,
	|	ТаблицаДокумента.Сумма,
	|	0
	|ИЗ
	|	ВременнаяТаблицаЗапасы КАК ТаблицаДокумента
	|ГДЕ
	//+++ Дмгг
	|	ВЫБОР
	|		КОГДА &ИспользоватьТолькоРегламентированногоПланаСчетов
	|			ТОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценкиРегл.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеДоходы)
	|	КОНЕЦ";
	//--- Дмгг
		
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаДоходыИРасходы", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаДоходыИРасходы()

// Формирует таблицу значений, содержащую данные для проведения по регистру.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура СформироватьТаблицаУправленческий(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("ТорговаяНаценка", НСтр("ka='სავაჭრო ფასნამატი';ru='Торговая наценка'"));
	Запрос.УстановитьПараметр("КурсоваяРазница", НСтр("ka='სხვაობა კურსებს შორის';ru='Курсовая разница'"));
	Запрос.УстановитьПараметр("ОтражениеДоходов", НСтр("ka='შემოსავლების ასახვა';ru='Отражение доходов'"));
	Запрос.УстановитьПараметр("ОтражениеРасходов", НСтр("ka='ხარჯების ასახვა';ru='Отражение расходов'"));
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический) КАК СценарийПланирования,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице КАК СчетДт,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки КАК СчетКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК ВалютаКт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СуммаВалДт,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ КАК СуммаВалКт,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ТорговаяНаценка)
	|			ТОГДА &ТорговаяНаценка
	|		ИНАЧЕ &ОтражениеДоходов
	|	КОНЕЦ КАК Содержание
	|ИЗ
	|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.ТипСчета <> ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки,
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаВРознице.Валютный
	|			ТОГДА ТаблицаДокумента.СуммаВал
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	-ТаблицаДокумента.Сумма,
	|	&ОтражениеРасходов
	|ИЗ
	|	ВременнаяТаблицаСуммовойУчетВРознице КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.СтруктурнаяЕдиницаСчетУчетаНаценки.ТипСчета = ЗНАЧЕНИЕ(Перечисление.ТипыСчетов.ПрочиеРасходы)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки,
	|	ТаблицаДокумента.Дата,
	|	ТаблицаДокумента.Организация,
	|	ЗНАЧЕНИЕ(Справочник.СценарииПланирования.Фактический),
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СчетУчета
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеРасходы)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ПрочиеДоходы)
	|		ИНАЧЕ ТаблицаДокумента.СчетУчета
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы < 0
	|				И ТаблицаДокумента.СчетУчета.Валютный
	|			ТОГДА ТаблицаДокумента.Валюта
	|		ИНАЧЕ НЕОПРЕДЕЛЕНО
	|	КОНЕЦ,
	|	0,
	|	0,
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.СуммаКурсовойРазницы > 0
	|			ТОГДА ТаблицаДокумента.СуммаКурсовойРазницы
	|		ИНАЧЕ -ТаблицаДокумента.СуммаКурсовойРазницы
	|	КОНЕЦ,
	|	&КурсоваяРазница
	|ИЗ
	|	ВременнаяТаблицаКурсовыхРазницСуммовойУчетВРознице КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры // СформироватьТаблицаУправленческий()

// Инициализирует таблицы значений, содержащие данные табличных частей документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПереоценкаВРозницеСуммовойУчет);
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("ПериодКонтроля", СтруктураДополнительныеСвойства.ДляПроведения.МоментВремени.Дата);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ВалютаУчета", Константы.ВалютаУчета.Получить());
	Запрос.УстановитьПараметр("ИспользоватьТолькоРегламентированногоПланаСчетов", ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.ИспользованиеТолькоРегламентированногоПланаСчетов(?(ЗначениеЗаполнено(ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Дата),ДокументСсылкаПереоценкаВРозницеСуммовойУчет.Дата,ТекущаяДата())));

	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МАКСИМУМ(ТаблицаДокумента.НомерСтроки) КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка) КАК ЗаказПокупателя,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице КАК СтруктурнаяЕдиницаСчетУчетаВРознице,
	|	ТаблицаДокумента.Ссылка.Корреспонденция КАК СтруктурнаяЕдиницаСчетУчетаНаценки,
	//+++ Дмгг
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл КАК СтруктурнаяЕдиницаСчетУчетаВРозницеРегл,
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл КАК СтруктурнаяЕдиницаСчетУчетаНаценкиРегл,
	//--- Дмгг
	|	&Организация КАК Организация,
	|	СУММА(ВЫРАЗИТЬ(ТаблицаДокумента.Сумма * КурсыВалютДокумента.Курс * КурсыВалютУчета.Кратность / (КурсыВалютУчета.Курс * КурсыВалютДокумента.Кратность) КАК ЧИСЛО(15, 2))) КАК Сумма,
	|	СУММА(ТаблицаДокумента.Сумма) КАК СуммаВал
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПереоценкаВРозницеСуммовойУчет.Запасы КАК ТаблицаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаУчета) КАК КурсыВалютУчета
	|		ПО (ИСТИНА)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, ) КАК КурсыВалютДокумента
	|		ПО ТаблицаДокумента.Ссылка.ВалютаДокумента = КурсыВалютДокумента.Валюта
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДокумента.Ссылка,
	|	ТаблицаДокумента.Ссылка.ВалютаДокумента,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ссылка.Корреспонденция,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРознице,
	//+++ Дмгг
	|	ТаблицаДокумента.Ссылка.КорреспонденцияРегл,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница.СчетУчетаВРозницеРегл";
	//--- Дмгг
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаСуммовойУчетВРознице(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаДоходыИРасходы(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, СтруктураДополнительныеСвойства);
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()

// Выполняет контроль возникновения отрицательных остатков.
//
Процедура ВыполнитьКонтроль(ДокументСсылкаПереоценкаВРозницеСуммовойУчет, ДополнительныеСвойства, Отказ, УдалениеПроведения = Ложь) Экспорт
	
	Если НЕ Константы.КонтролироватьОстаткиПриПроведении.Получить() Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураВременныеТаблицы = ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы;
	
	// Если временные таблицы содержат записи, необходимо выполнить контроль
	// отрицательных остатков.
	Если СтруктураВременныеТаблицы.ДвиженияСуммовойУчетВРозницеИзменение Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ДвиженияСуммовойУчетВРозницеИзменение.НомерСтроки КАК НомерСтроки,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСуммовойУчетВРозницеИзменение.Организация) КАК ОрганизацияПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница) КАК СтруктурнаяЕдиницаПредставление,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница.РозничныйВидЦен.ВалютаЦены) КАК ВалютаПредставление,
		|	ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалИзменение + ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаВалОстаток, 0) КАК ОстатокВРознице,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаПередЗаписью КАК СуммаПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаПриЗаписи КАК СуммаПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаИзменение КАК СуммаИзменение,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалПередЗаписью КАК СуммаВалПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалПриЗаписи КАК СуммаВалПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СуммаВалИзменение КАК СуммаВалИзменение,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьПередЗаписью КАК СебестоимостьПередЗаписью,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьПриЗаписи КАК СебестоимостьПриЗаписи,
		|	ДвиженияСуммовойУчетВРозницеИзменение.СебестоимостьИзменение КАК СебестоимостьИзменение
		|ИЗ
		|	ДвиженияСуммовойУчетВРозницеИзменение КАК ДвиженияСуммовойУчетВРозницеИзменение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.СуммовойУчетВРознице.Остатки(
		|				&МоментКонтроля,
		|				(Организация, СтруктурнаяЕдиница) В
		|					(ВЫБРАТЬ
		|						ДвиженияСуммовойУчетВРозницеИзменение.Организация КАК Организация,
		|						ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
		|					ИЗ
		|						ДвиженияСуммовойУчетВРозницеИзменение КАК ДвиженияСуммовойУчетВРозницеИзменение)) КАК СуммовойУчетВРозницеОстатки
		|		ПО ДвиженияСуммовойУчетВРозницеИзменение.Организация = СуммовойУчетВРозницеОстатки.Организация
		|			И ДвиженияСуммовойУчетВРозницеИзменение.СтруктурнаяЕдиница = СуммовойУчетВРозницеОстатки.СтруктурнаяЕдиница
		|ГДЕ
		|	ЕСТЬNULL(СуммовойУчетВРозницеОстатки.СуммаВалОстаток, 0) < 0
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки");
		
		Запрос.МенеджерВременныхТаблиц = СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
		Запрос.УстановитьПараметр("МоментКонтроля", ДополнительныеСвойства.ДляПроведения.МоментКонтроля);
		
		МассивРезультатов = Запрос.ВыполнитьПакет();
		
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ДокументОбъектПереоценкаВРозницеСуммовойУчет = ДокументСсылкаПереоценкаВРозницеСуммовойУчет.ПолучитьОбъект()
		КонецЕсли;
		
		// Отрицательный остаток по суммовому учету в рознице.
		Если НЕ МассивРезультатов[0].Пустой() Тогда
			ВыборкаИзРезультатаЗапроса = МассивРезультатов[0].Выбрать();
			УправлениеНебольшойФирмойСервер.СообщитьОбОшибкахПроведенияПоРегиструСуммовойУчетВРознице(ДокументОбъектПереоценкаВРозницеСуммовойУчет, ВыборкаИзРезультатаЗапроса, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьКонтроль()

#Область ИнтерфейсПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
